#Zadanie
#1
n = float(input("Введите стоимость килограмма конфет \n "))
i = 1
for i in range(10):
  i += 1
  st=i*n
  print(f'{i} Киллограм стоит {st} рублей')

#2
n=[14, 5, 17, 44, 23, 34, 88, 0] #задаем последовательность
i=0
sum=0
while n[i] != 0: #задаем цикл
    sum += n[i]
    i+=1 #переключаем номер списка
print(f'Сумма равняется {sum}')

#HomeWork
#1
n=int(input("Введите число:"))
sum=0
if n>100:
    print("Введите число не более ста")
    exit()
for i in range(n):
    n=i+1
    n**=3
    sum +=n
    print(n)
print(f'Сумма кубов последовательности равна {sum}')

#2
for i in range(1,10):
    print(f'Умножение на {i}')
    for f in range(1,10):
        print(f'{i}*{f}={i*f}')
    print("-------")

#3
n=[7, 6, 4, 9, 5, 2, 1, 0, 3, 8]
kol=0
print(f'Исходный массив: {n}')
for i in n:
    kol += 1 #считаем количество чисел в строке
print("Поворачиваем массив на 90 градусов против часовой стрелки:")
while kol != 0: #задаем цикл, который пишет нам числа строки с конца по порядку
    kol -=1
    print(n[kol]) #выводим результат