import math #подключаем библиотеку math
#1
r = float(input("Введите радиус в сантиметрах: ")) #вводим радиус окружности
print('Длинна окружности с радиусом', r)
print(round(2*math.pi*r,2)) #длинна окружности
print('Площадь круга с радиусом', r)
print(round(math.pi*r**2,2)) #площадь круга

#2
x,y=10,55 #задаем значения x и y
print(f"ДО x, y = {x}, {y}") #выводим начальные значения
x,y =y,x #меняем значения
print(f"ПОСЛЕ x, y = {x}, {y}") #выводим итоговые значения
 
#3
L = float(input("Введите длинну маятника в метрах: "))
T=(round(2*math.pi*math.sqrt(L/9.81),2)) #вычисляем период
print (T)#вывод результата
#print(str(round(2*math.pi*math.sqrt(L/9.81),2)))
