#1
import re
nomera='А123ВС178 О456СН52 КВ99951 ЕУ777666'
print('Список номеров частных автомобилей:', re.findall(r'\b[АВЕКМНОРСТУХ]\d{3}[АВЕКМНОРСТУХ]{2}\d{2,3}\b', nomera))
print('Список номеров такси', re.findall(r'\b[АВЕКМНОРСТУХ]{2}\d{3}\d{2,3}\b', nomera)) 

#2
text = input()
print(len(re.findall(r"\b[a-zа-я][a-zа-я-]*\b", text)))

#3
letter = 'Уважаемые! Если вы к 09:00 не вернёте чемодан, то уже в 09:00:01 я за себя не отвечаю.'
zamena= r'((?:[01]\d|2[0-3])\:(?:[0-5]\d)(?:\:[0-5]\d)?)'
result = re.sub(zamena, "(TBD)", letter)
print(result)

#4
text = 'Инициальные аббревиатуры пишутся прописными буквами: ООН, МИД, РФ. Точки или пробелы между буквами не ставятся, но между двумя самостоятельно употребляющимися аббревиатурами используется пробел: ИРЯ РАН, МИД РФ.'
print("Найденные аббревиатуры:", re.findall(r'[А-Я]{2,}(?:\s+[А-Я]{2,})*', text))