import pandas as pd
# DataFrame проще всего сконструировать на примере питоновского словаря
df = pd.DataFrame({
     'country': ['Kazakhstan', 'Russia', 'Belarus', 'Ukraine'],
     'population': [17.04, 143.5, 9.5, 45.5],
     'square': [2724902, 17125191, 207600, 603628]})
print(df)
# Чтобы убедиться, что столбец в DataFrame это Series, извлекаем любой:
print(df['country'])
print(type(df['country']))
# Объект DataFrame имеет 2 индекса: по строкам и по столбцам. 
# Если индекс по строкам явно не задан (например, колонка по которой нужно их строить),
# то pandas задаёт целочисленный индекс RangeIndex от 0 до N-1, где N это 
# количество строк в таблице.
print(df.columns)
print(df.index)
#В таблице у нас 4 элемента от 0 до 3.

# pandas поддерживает все самые популярные форматы хранения данных: csv, excel, sql, 
# буфер обмена, html и многое другое. Чаще всего приходится работать с csv-файлами. 
# Например, чтобы сохранить наш DataFrame со странами, достаточно написать
df.to_csv('filename.csv')
# Функции to_csv ещё передаются различные аргументы (например, символ разделителя между
# колонками) о которых подробнее можно узнать в официальной документации.
# Считать данные из csv-файла и превратить в DataFrame можно функцией read_csv
df = pd.read_csv('filename.csv', sep=',')